"""
Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество
элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки.



"""

# a1 = int(input('Введите первый элемент = '))
# d = int(input('Введите разность элементов = '))
# n = int(input('Введите количество элементов = '))
# for i in range(n):
#     print(a1 + i * d, ' ')

"""
Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному
диапазону (т.е. не меньше заданного минимума и не больше заданного максимума) 
"""

# n = int(input('Введите количество элементов массива: '))
#
# import random
# some_list_1 = list(random.randint(-10, 10) for i in range(n))
# print(some_list_1)
#
# some_list_2 = []
#
# max = int(input('Введите максимум = '))
# min = int(input('Введите минимум = '))
#
# for i in range(len(some_list_1)):
#     if some_list_1[i] >= min and some_list_1[i] <= max:
#         some_list_2.append(i)
#
# print(some_list_2)
